MikroElektronika/core_packages/PIC32/XC32/def/PIC32MZ1025DAH169/mcu.h
extern volatile __GLCDCLUT19bits_t GLCDCLUT19bits __asm__ ("GLCDCLUT19") __attribute__((section("sfrs"), address(0xBF8EA44C)));
#define GLCDCLUT20 GLCDCLUT20
extern volatile uint32_t   GLCDCLUT20 __attribute__((section("sfrs"), address(0xBF8EA450)));
typedef struct {
  uint32_t BLUE:8;
  uint32_t GREEN:8;
  uint32_t RED:8;
} __GLCDCLUT20bits_t;
extern volatile __GLCDCLUT20bits_t GLCDCLUT20bits __asm__ ("GLCDCLUT20") __attribute__((section("sfrs"), address(0xBF8EA450)));
#define GLCDCLUT21 GLCDCLUT21
extern volatile uint32_t   GLCDCLUT21 __attribute__((section("sfrs"), address(0xBF8EA454)));
typedef struct {
  uint32_t BLUE:8;
  uint32_t GREEN:8;
  uint32_t RED:8;
} __GLCDCLUT21bits_t;
extern volatile __GLCDCLUT21bits_t GLCDCLUT21bits __asm__ ("GLCDCLUT21") __attribute__((section("sfrs"), address(0xBF8EA454)));
#define GLCDCLUT22 GLCDCLUT22
extern volatile uint32_t   GLCDCLUT22 __attribute__((section("sfrs"), address(0xBF8EA458)));
typedef struct {
  uint32_t BLUE:8;
  uint32_t GREEN:8;
  uint32_t RED:8;
} __GLCDCLUT22bits_t;
extern volatile __GLCDCLUT22bits_t GLCDCLUT22bits __asm__ ("GLCDCLUT22") __attribute__((section("sfrs"), address(0xBF8EA458)));
#define GLCDCLUT23 GLCDCLUT23
extern volatile uint32_t   GLCDCLUT23 __attribute__((section("sfrs"), address(0xBF8EA45C)));
typedef struct {
  uint32_t BLUE:8;
  uint32_t GREEN:8;
  uint32_t RED:8;
} __GLCDCLUT23bits_t;
extern volatile __GLCDCLUT23bits_t GLCDCLUT23bits __asm__ ("GLCDCLUT23") __attribute__((section("sfrs"), address(0xBF8EA45C)));
#define GLCDCLUT24 GLCDCLUT24
extern volatile uint32_t   GLCDCLUT24 __attribute__((section("sfrs"), address(0xBF8EA460)));
typedef struct {
  uint32_t BLUE:8;
  uint32_t GREEN:8;
  uint32_t RED:8;
} __GLCDCLUT24bits_t;
extern volatile __GLCDCLUT24bits_t GLCDCLUT24bits __asm__ ("GLCDCLUT24") __attribute__((section("sfrs"), address(0xBF8EA460)));
#define GLCDCLUT25 GLCDCLUT25
extern volatile uint32_t   GLCDCLUT25 __attribute__((section("sfrs"), address(0xBF8EA464)));
typedef struct {
  uint32_t BLUE:8;
  uint32_t GREEN:8;
  uint32_t RED:8;
} __GLCDCLUT25bits_t;
extern volatile __GLCDCLUT25bits_t GLCDCLUT25bits __asm__ ("GLCDCLUT25") __attribute__((section("sfrs"), address(0xBF8EA464)));
#define GLCDCLUT26 GLCDCLUT26
extern volatile uint32_t   GLCDCLUT26 __attribute__((section("sfrs"), address(0xBF8EA468)));
typedef struct {
  uint32_t BLUE:8;
  uint32_t GREEN:8;
  uint32_t RED:8;
} __GLCDCLUT26bits_t;
extern volatile __GLCDCLUT26bits_t GLCDCLUT26bits __asm__ ("GLCDCLUT26") __attribute__((section("sfrs"), address(0xBF8EA468)));
#define GLCDCLUT27 GLCDCLUT27
extern volatile uint32_t   GLCDCLUT27 __attribute__((section("sfrs"), address(0xBF8EA46C)));
typedef struct {
  uint32_t BLUE:8;
  uint32_t GREEN:8;
  uint32_t RED:8;
} __GLCDCLUT27bits_t;
extern volatile __GLCDCLUT27bits_t GLCDCLUT27bits __asm__ ("GLCDCLUT27") __attribute__((section("sfrs"), address(0xBF8EA46C)));
#define GLCDCLUT28 GLCDCLUT28
extern volatile uint32_t   GLCDCLUT28 __attribute__((section("sfrs"), address(0xBF8EA470)));
typedef struct {
  uint32_t BLUE:8;
  uint32_t GREEN:8;
  uint32_t RED:8;
} __GLCDCLUT28bits_t;
extern volatile __GLCDCLUT28bits_t GLCDCLUT28bits __asm__ ("GLCDCLUT28") __attribute__((section("sfrs"), address(0xBF8EA470)));
#define GLCDCLUT29 GLCDCLUT29
extern volatile uint32_t   GLCDCLUT29 __attribute__((section("sfrs"), address(0xBF8EA474)));
typedef struct {
  uint32_t BLUE:8;
  uint32_t GREEN:8;
  uint32_t RED:8;
} __GLCDCLUT29bits_t;
extern volatile __GLCDCLUT29bits_t GLCDCLUT29bits __asm__ ("GLCDCLUT29") __attribute__((section("sfrs"), address(0xBF8EA474)));
#define GLCDCLUT30 GLCDCLUT30
extern volatile uint32_t   GLCDCLUT30 __attribute__((section("sfrs"), address(0xBF8EA478)));
typedef struct {
  uint32_t BLUE:8;
  uint32_t GREEN:8;
  uint32_t RED:8;
} __GLCDCLUT30bits_t;
extern volatile __GLCDCLUT30bits_t GLCDCLUT30bits __asm__ ("GLCDCLUT30") __attribute__((section("sfrs"), address(0xBF8EA478)));
#define GLCDCLUT31 GLCDCLUT31
extern volatile uint32_t   GLCDCLUT31 __attribute__((section("sfrs"), address(0xBF8EA47C)));
typedef struct {
  uint32_t BLUE:8;
  uint32_t GREEN:8;
  uint32_t RED:8;
} __GLCDCLUT31bits_t;
extern volatile __GLCDCLUT31bits_t GLCDCLUT31bits __asm__ ("GLCDCLUT31") __attribute__((section("sfrs"), address(0xBF8EA47C)));
#define GLCDCLUT32 GLCDCLUT32
extern volatile uint32_t   GLCDCLUT32 __attribute__((section("sfrs"), address(0xBF8EA480)));
typedef struct {
  uint32_t BLUE:8;
  uint32_t GREEN:8;
  uint32_t RED:8;
} __GLCDCLUT32bits_t;
extern volatile __GLCDCLUT32bits_t GLCDCLUT32bits __asm__ ("GLCDCLUT32") __attribute__((section("sfrs"), address(0xBF8EA480)));
#define GLCDCLUT33 GLCDCLUT33
extern volatile uint32_t   GLCDCLUT33 __attribute__((section("sfrs"), address(0xBF8EA484)));
typedef struct {
  uint32_t BLUE:8;
  uint32_t GREEN:8;
  uint32_t RED:8;
} __GLCDCLUT33bits_t;
extern volatile __GLCDCLUT33bits_t GLCDCLUT33bits __asm__ ("GLCDCLUT33") __attribute__((section("sfrs"), address(0xBF8EA484)));
#define GLCDCLUT34 GLCDCLUT34
extern volatile uint32_t   GLCDCLUT34 __attribute__((section("sfrs"), address(0xBF8EA488)));
typedef struct {
  uint32_t BLUE:8;
  uint32_t GREEN:8;
  uint32_t RED:8;
} __GLCDCLUT34bits_t;
extern volatile __GLCDCLUT34bits_t GLCDCLUT34bits __asm__ ("GLCDCLUT34") __attribute__((section("sfrs"), address(0xBF8EA488)));
#define GLCDCLUT35 GLCDCLUT35
extern volatile uint32_t   GLCDCLUT35 __attribute__((section("sfrs"), address(0xBF8EA48C)));
typedef struct {
  uint32_t BLUE:8;
  uint32_t GREEN:8;
  uint32_t RED:8;
} __GLCDCLUT35bits_t;
extern volatile __GLCDCLUT35bits_t GLCDCLUT35bits __asm__ ("GLCDCLUT35") __attribute__((section("sfrs"), address(0xBF8EA48C)));
#define GLCDCLUT36 GLCDCLUT36
extern volatile uint32_t   GLCDCLUT36 __attribute__((section("sfrs"), address(0xBF8EA490)));
typedef struct {
  uint32_t BLUE:8;
  uint32_t GREEN:8;
  uint32_t RED:8;
} __GLCDCLUT36bits_t;
extern volatile __GLCDCLUT36bits_t GLCDCLUT36bits __asm__ ("GLCDCLUT36") __attribute__((section("sfrs"), address(0xBF8EA490)));
#define GLCDCLUT37 GLCDCLUT37
extern volatile uint32_t   GLCDCLUT37 __attribute__((section("sfrs"), address(0xBF8EA494)));
typedef struct {
  uint32_t BLUE:8;
  uint32_t GREEN:8;
  uint32_t RED:8;
} __GLCDCLUT37bits_t;
extern volatile __GLCDCLUT37bits_t GLCDCLUT37bits __asm__ ("GLCDCLUT37") __attribute__((section("sfrs"), address(0xBF8EA494)));
#define GLCDCLUT38 GLCDCLUT38
extern volatile uint32_t   GLCDCLUT38 __attribute__((section("sfrs"), address(0xBF8EA498)));
typedef struct {
  uint32_t BLUE:8;
  uint32_t GREEN:8;
  uint32_t RED:8;
} __GLCDCLUT38bits_t;
extern volatile __GLCDCLUT38bits_t GLCDCLUT38bits __asm__ ("GLCDCLUT38") __attribute__((section("sfrs"), address(0xBF8EA498)));
#define GLCDCLUT39 GLCDCLUT39
extern volatile uint32_t   GLCDCLUT39 __attribute__((section("sfrs"), address(0xBF8EA49C)));
typedef struct {
  uint32_t BLUE:8;
  uint32_t GREEN:8;
  uint32_t RED:8;
} __GLCDCLUT39bits_t;
extern volatile __GLCDCLUT39bits_t GLCDCLUT39bits __asm__ ("GLCDCLUT39") __attribute__((section("sfrs"), address(0xBF8EA49C)));
#define GLCDCLUT40 GLCDCLUT40
extern volatile uint32_t   GLCDCLUT40 __attribute__((section("sfrs"), address(0xBF8EA4A0)));
typedef struct {
  uint32_t BLUE:8;
  uint32_t GREEN:8;
  uint32_t RED:8;
} __GLCDCLUT40bits_t;
extern volatile __GLCDCLUT40bits_t GLCDCLUT40bits __asm__ ("GLCDCLUT40") __attribute__((section("sfrs"), address(0xBF8EA4A0)));
#define GLCDCLUT41 GLCDCLUT41
extern volatile uint32_t   GLCDCLUT41 __attribute__((section("sfrs"), address(0xBF8EA4A4)));
typedef struct {
  uint32_t BLUE:8;
  uint32_t GREEN:8;
  uint32_t RED:8;
} __GLCDCLUT41bits_t;
extern volatile __GLCDCLUT41bits_t GLCDCLUT41bits __asm__ ("GLCDCLUT41") __attribute__((section("sfrs"), address(0xBF8EA4A4)));
#define GLCDCLUT42 GLCDCLUT42
extern volatile uint32_t   GLCDCLUT42 __attribute__((section("sfrs"), address(0xBF8EA4A8)));
typedef struct {
  uint32_t BLUE:8;
  uint32_t GREEN:8;
  uint32_t RED:8;
} __GLCDCLUT42bits_t;
extern volatile __GLCDCLUT42bits_t GLCDCLUT42bits __asm__ ("GLCDCLUT42") __attribute__((section("sfrs"), address(0xBF8EA4A8)));
#define GLCDCLUT43 GLCDCLUT43
extern volatile uint32_t   GLCDCLUT43 __attribute__((section("sfrs"), address(0xBF8EA4AC)));
typedef struct {
  uint32_t BLUE:8;
  uint32_t GREEN:8;
  uint32_t RED:8;
} __GLCDCLUT43bits_t;
extern volatile __GLCDCLUT43bits_t GLCDCLUT43bits __asm__ ("GLCDCLUT43") __attribute__((section("sfrs"), address(0xBF8EA4AC)));
#define GLCDCLUT44 GLCDCLUT44
extern volatile uint32_t   GLCDCLUT44 __attribute__((section("sfrs"), address(0xBF8EA4B0)));
typedef struct {
  uint32_t BLUE:8;
  uint32_t GREEN:8;
  uint32_t RED:8;
} __GLCDCLUT44bits_t;
